[
    {
        "id": 1,
        "url": "https://www.businesstoday.in/markets/ipo-corner/story/mamata-machinery-ipo-allotment-status-check-application-latest-gmp-listing-date-458358-2024-12-24",
        "title": "Mamata Machinery IPO allotment status: Check application, latest GMP & listing date - BusinessToday",
        "info": "Mamata Machinery is scheduled to finalize the basis of allotment of its shares on Tuesday, December 24. Bidders will get the messages, alerts or emails for debit of their funds or revocations of their IPO mandate latest by Thursday, December 26. The industrial instruments maker had received a bumper response from the investors during the three-day bidding.  The IPO of Mamata Machinery was open for bidding between December 19-23. It had offered its shares in the price band of Rs 230-243 per share with a lot size of 61 shares. The company raised a total of Rs 179.39 crore from its IPO, which was entirely an offer-for-sale (OFS) of up to 73,82,340 equity shares.  The issue was overall subscribed a whopping 194.95 times, thanks to all round-bidding. The portion for qualified-institutional bidders (QIBs) was subscribed about 235.88 times. The portion for non-institutional investors (NIIs) was booked 274.38 times. Allocations for retail investors and employees were booked 138.08 times and 153.27 times, respectively.  Grey market premium (GMP) of Mamata Machinery has managed to hold its ground despite the volatility in the broader markets. Last heard, the company was commanding a premium of Rs 260 in the unofficial market, suggesting a listing pop of up to 107 per cent for the investors. The GMP has remained stable over the period.  Incorporated in April 1979, Ahmedabad-based Mamata Machinery manufactures and exports machines for making plastic bags, pouches, packaging, and extrusion equipment. The company provides manufacturing solutions for the packaging industry, primarily catering to FMCG, food & beverage industries.  Beeline Capital Advisors is the sole book running lead manager of the Mamata Machinery IPO, while Link Intime India is the registrar for the issue. Shares of the company shall be listed on both NSE and BSE with Friday, December 27, Tuesday as the tentative date of listing.  Investors, who had bid for the issue of Mamata Machinery, can check the allotment status on the Bombay Stock Exchange (BSE) website: 1) Visit https://www.bseindia.com/investors/appli_check.aspx 2) Under the issue type, click Equity 3) Under the issue name, select Mamata Machinery Limited in the dropbox 4) Write the application number 5) Add the PAN card ID 6) Click on 'I am not a Robot' and hit search button Investors can also check the allotment status on the online portal of Link Intime India (https://linkintime.co.in/MIPO/Ipoallotment.html), the registrar to the issue.  The registrar is a Sebi-registered entity, qualified to act as such and which electronically processes all applications and carries out the allotment process, as per the prospectus. It is responsible for complying with the timelines for updating the electronic credit of shares to successful applicants, dispatching and uploading refunds, and attending to all investor-related queries post issue. 1) Go to the web portal of Link Intime Limited 2) Select the IPO/FPO in dropbox whose name will be populated only if the allotment is finalized 3) You may be required to select either one of the three modes: Application number, Demat Account number, or PAN ID 4) In application type, select between ASBA and non-ASBA 5) Enter the details of the mode you selected in Step 2 6) For security purposes, fill the captcha accurately 7) Hit submit."
    },
    {
        "id": 2,
        "url": "https://www.businesstoday.in/markets/stocks/story/jubilant-foodworks-lupin-coromandel-international-heres-how-to-trade-these-3-stocks-458494-2024-12-25",
        "title": "Jubilant Foodworks, Lupin & Coromandel International: Here's how to trade these 3 stocks - BusinessToday",
        "info": "Religare Broking has included shares of Jubilant Foodworks Ltd, Lupin Ltd and Coromandel International Ltd as its top three technical 'Buy' calls for this holiday-truncated week. Domestic benchmarks were closed on Wednesday to mark Christmas 2024. The equity indices will resume action on Thursday. The indices settled slightly lower in the previous session as metals, IT, PSU banks and financials dragged. The 30-share BSE Sensex pack fell 67 points or 0.09 per cent to settle at 78,473, while the broader NSE Nifty index moved 26 points or 0.11 per cent down to close at 23,728. Broader markets (mid- and small-cap shares) finished on a mixed note, with the Nifty Midcap 100 slipping 0.06 per cent and Nifty Smallcap 100 rising 0.24 per cent. India VIX, fear index, shed 2.53 per cent to 13.18-level. That said, domestic brokerage Religare suggested that Jubilant Foodworks, Lupin and Coromandel Int'l can stay under the spotlight of traders this week. Here's what the broking firm has to say about these three stocks: 1) Jubilant Foodworks | LTP: Rs 704.15 | Target: Rs 745 | Stop loss: Rs 685 The stock experienced a V-shaped recovery after testing the neckline of its previous breakout zone. To digest some gains, it witnessed a minor price and timewise correction, resulting in the formation of a 'cup and handle' pattern. The recent price action supported by strong volumes indicates a breakout soon from the mentioned pattern, which may lead to a strong upmove from current levels. One can consider taking near-term positions in the stock. 2) Lupin Limited | LTP: Rs 2,169.45 | Target: Rs 2,270 | Stop loss: Rs 2,110 The pharma sector is showing resilience during its market corrective phase and Lupin too is holding strong above the confluence of its short- to medium-term moving averages. The stock has established a strong base while consolidating in a broader range for over a month. It is now gradually inching higher after a breakout from the same, which provides a good opportunity for participants to accumulate the stock. 3) Coromandel International Limited | LTP: Rs 1,855.35 | Target: Rs 1,990 | Stop loss: Rs 1,790 Coromandel has broken out of its consolidation phase after establishing a robust base around its 20-day exponential moving average (DEMA). Additionally, the stock has reclaimed its all-time high after nearly four months of consolidation. The chart pattern, supported by confirmation from technical indicators, suggests a steady upward trajectory in the near term. Nifty outlook: \"Market appears to be consolidating after the recent decline and is currently hovering around the support zone of its long-term moving average (200 DEMA). Among the sectoral indices, pharma and FMCG are showing resilience while we are seeing pressure across the board. Signs point to a potential further drop. So, traders should exercise caution and remain selective,\" Religare said."
    },
    {
        "id": 3,
        "url": "https://www.businesstoday.in/markets/stocks/story/hcc-shares-tank-4-on-claims-settlement-key-details-458384-2024-12-24",
        "title": "HCC shares tanked 4% today on claims settlement; key details   - BusinessToday",
        "info": "Shares of Hindustan Construction Company Ltd (HCC) tumbled 4 per cent in Tuesday's trade after the company completed a claims settlement with a major client for Rs 180 crore. This has resulted in the reduction of client advances amounting to around Rs 130 crore. The balance Rs 50 crore is being received as cash consideration, HCC informed stock exchanges.  HCC shares fell 4.2 per cent to hit a low of Rs 39.21 on BSE. The stock is still up 40.86 per cent in 2024 so far.  \"The company has completed a claims settlement with a major client for Rs 180 crore, resulting in the reduction of client advances amounting to around Rs 130 crore (implying a reduction of annual financing charges of Rs 15 crore), with the balance Rs 50 crore being received as cash consideration, thereby boosting liquidity,\" HCC said.  The company’s order book stood at Rs 9,773 crore as of September 30, 2024. Post its Q2 results in October, HCC said it has submitted bids worth Rs 3,800 crore which are under evaluation while work is well underway on a future bid pipeline of Rs 46,000 crore.  ICRA expects HCC to ramp-up its gross billing from the core EPC business with inflow of new orders, while maintaining adequate operating margins. ICRA has factored in the likely support to the liquidity profile from the fund infusion.  HCC’s long track record of operations of over nine decades, supported by an experienced management and demonstrated capabilities in executing relatively complex tunnelling and hydro projects, ICRA said. For the quarter HCC had reported a standalone turnover and net profit of Rs 1,203 crore and Rs 50.20 crore, respectively.  HCC was awarded a Rs 1,031.60 crore contract in October and was the lowest bidder in projects worth Rs ,860 crore. The company reported consolidated revenue of Rs 1,407 crore in Q2 against Rs 1,832.60 crore in Q2FY24. The consolidated profit was at Rs 64 crore in Q2 against Rs 6.40 crore in Q2FY24. In the September quarter, HCC received its project taking over certificate for Delhi Metro’s DC06 package and the south bound arm of the Mumbai Coastal Road Project was inaugurated by the Chief Minister of Maharashtra. The Vishnugad Pipalkoti hydropower project saw completion of 3.5 km tunnel out of 12.1 km using TBM, with a peak TBM mining of 509 m achieved in September 2024.  \"Significant progress has been achieved on the Anji Khad Bridge, Mumbai Metro Line 3 and Tehri Pumped Storage projects,\" HCC said post its Q2 results. HCC raised Rs 350 crore through rights issue in April 2024.  \"Timely realisation of these funds remains critical for debt repayments in March 2025. Going forward, timely monetisation of non-core assets and realisation of awards remains crucial to materially improve its liquidity position. In absence of sanctioned fund-based working capital lines, the company is maintaining over Rs 200 crore of liquidity on a sustained basis. ICRA draws comfort from the cushion available in the form of unutilised arbitration/court BGs that could be used to realise some of the awards pending in the higher courts, in case of funding shortfall,\" ICRA said."
    },
    {
        "id": 4,
        "url": "https://www.businesstoday.in/india/story/delhi-weather-update-imd-issues-yellow-alert-as-dense-fog-disrupts-flights-check-igi-airport-advisory-458465-2024-12-25",
        "title": "Delhi weather update: IMD issues yellow alert as dense fog disrupts flights: Check IGI airport advisory - BusinessToday",
        "info": "Delhi and its surrounding areas experienced a thick blanket of fog on Christmas morning, significantly reducing visibility and impacting flight operations. The India Meteorological Department (IMD) issued a yellow alert for the day, warning of dense fog during the early hours. The maximum and minimum temperatures are expected to reach 22 degrees Celsius and 9 degrees Celsius, respectively, with visibility reported at just 100 meters at both Safdarjung and Palam, the city’s official weather stations. In a statement on social media, the Delhi airport confirmed that while landings and takeoffs were ongoing, flights not equipped with CAT III navigation systems could face disruptions. \"Passengers are requested to contact their airlines for updated flight information. We regret any inconvenience caused,\" the airport tweeted at 5:45 AM.   CAT III systems allow aircraft to land safely in low visibility conditions, such as those currently affecting the region. Earlier in the day, at 1:40 AM, the airport noted that low visibility procedures were in effect, but flight operations remained normal. Meanwhile, the Air Quality Index (AQI) in Delhi registered a reading of 334 at 6 AM, categorising it as 'very poor,' an improvement from Tuesday's 398. Following rain on Tuesday evening, the AQI had slightly improved to 358, prompting the lifting of GRAP-IV restrictions, which included a ban on construction activities. Of the 37 monitoring stations, two—Mundka and Nehru Nagar—recorded 'severe' air quality, while 32 stations fell into the 'very poor' category. The weather office reported a maximum temperature of 20.8 degrees Celsius, which is above the seasonal average, with cloudy skies expected throughout the day. The minimum temperature was noted at 9.9 degrees Celsius, also two degrees above normal. Additionally, the IMD has forecast another spell of rain in Delhi from December 26 to 28. Christmas showers On Christmas Eve, Delhi had an unexpected change in weather with light rain covering different areas of the city, adding a festive chill. This rainfall, occurring on Tuesday, offered some short-term relief from the ongoing pollution problems in the capital."
    },
    {
        "id": 5,
        "url": "https://www.businesstoday.in/latest/corporate/story/those-who-make-tons-of-money-emcures-namita-thapar-challenges-narayana-murthys-70-hour-workweek-advice-458183-2024-12-22",
        "title": "'Those who make tons of money...': Emcure's Namita Thapar challenges Narayana Murthy‚Äôs 70-hour workweek advice - BusinessToday",
        "info": "India’s work culture just got its own cage match, and the gloves are off. Shark Tank India stars Anupam Mittal and Namita Thapar locked horns in a fiery exchange over the controversial 70-hour workweek during an interview with Humans of Bombay.  Mittal called long work hours a “big lie,” while Thapar slammed his take as “a crock of bullsh*t.” The clash has reignited a heated national debate about productivity, work-life balance, and the toll of hustle culture in India. Anupam Mittal, founder of Shaadi.com, dismissed the obsession with long hours, calling it \"a big lie being told to this generation.\" Reflecting on his early days working 16-hour shifts in the U.S., Mittal argued that success stems from effort and strategy, not time spent.  He cited his company’s hybrid model as proof, claiming it increased productivity by 30%. “Work-life balance is destroying a whole generation,” he stated, advocating instead for “work-life harmony.” For Mittal, young professionals should push themselves in the early years of their careers to build character and achieve extraordinary results. Namita Thapar, Executive Director - India Business, Emcure Pharmaceuticals, fired back, labeling Mittal’s argument as a \"crock of bullsh*t.\" Thapar insisted that the reality for founders and employees is fundamentally different. “Founders like me have significant financial stakes and can afford to work around the clock, but employees cannot,” she said. She added that demanding non-stop work hours from employees can lead to severe physical and mental health consequences. Thapar explained that while she worked grueling hours to help take Emcure public, employees do not share the same financial upside and should not be held to such expectations. This debate stems from Infosys co-founder Narayana Murthy’s recent call for India’s youth to adopt a 70-hour workweek to boost productivity and compete globally. While Mittal champions the idea of pushing limits for success, Thapar argues for realistic boundaries, highlighting the human cost of overwork."
    },
    {
        "id": 6,
        "url": "https://www.businesstoday.in/latest/trends/story/indian-workers-cheaper-disposable-argentine-ceos-argument-on-global-wage-gap-triggers-debate-458394-2024-12-24",
        "title": "‚ÄòIndian workers cheaper, disposable...':  Argentine CEO's argument on global wage gap triggers debate - BusinessToday",
        "info": "Franco Pereyra, co-founder and COO of Near, has sparked a fiery debate over global wage disparities with a controversial LinkedIn post. Near, a platform that connects U.S. companies with remote talent from Latin America, is rooted in the promise of bridging global workforces. However, Pereyra’s assertion that it is fair for global workers to be paid less than their American counterparts has polarized opinions online. “As an Argentinian living in Buenos Aires, I see how some people get upset by that statement,” Pereyra wrote. “But I get to stay in my country, be with my family, and enjoy a lower cost of living.” For Pereyra, wage differences are justifiable when viewed through the lens of local economics. Pereyra also acknowledged the backlash his stance has provoked. “A lot of people get upset and say workers in Latin America, India, and the Philippines are being exploited. And yes, there are certainly companies that do exploit global talent. But paying less for overseas work is not inherently wrong,” he added. The post quickly made its way to the “LinkedIn Lunatics” subreddit, where opinions were sharply divided. Some defended his perspective, citing the economic logic of offshoring. “That’s just how offshoring works. If they weren’t able to pay people in lower cost-of-living countries less money, they wouldn’t employ those people,” one user commented. Others criticized Pereyra for oversimplifying a multifaceted issue, with one commenter pointing out, “It is odd that he never mentioned the cost of living or working conditions.”   In a follow-up post, Pereyra shifted the focus to exploitative practices within global hiring, particularly in regions like India and the Philippines. “I see this happen way too often, especially with talent from India and the Philippines—a revolving door of workers treated as disposable,” he wrote. Pereyra emphasized the impact of such practices on both employees and companies, saying, “The employees have a miserable couple of months and then leave, while the company deals with the chaos of constant turnover, rehiring, and retraining.” The debate surrounding Pereyra’s remarks highlights deeper issues in the global labor market. While Indian IT workers and other international talent drive innovation in critical sectors like SaaS and technology, they often face undervalued contributions, low wages, and limited benefits."
    },
    {
        "id": 7,
        "url": "https://www.businesstoday.in/personal-finance/tax/story/itr-filing-deadline-bombay-hc-asks-cbdt-to-extend-timing-to-file-itrs-for-taxpayers-claiming-87a-rebate-458376-2024-12-24",
        "title": "ITR filing deadline: Bombay HC asks CBDT to extend timing to file ITRs for taxpayers claiming 87A rebate - BusinessToday",
        "info": "The Bombay High Court has instructed the Central Board of Direct Taxes (CBDT) to issue a notification extending the deadline for revised and belated Income Tax Return (ITR) filings until January 15, 2025. This extension applies only to taxpayers eligible for claiming the section 87A tax rebate.  This is in response to a Public Interest Litigation (PIL) filed by The Chamber of Tax Consultants. It is important to note that this extension is temporary, as the final decision will be announced on January 9, 2025, the Economic Times reported. How much tax do I have to pay? Calculate now What's the issue? The Income Tax offers rebate under Section 87A to individual taxpayers whose income does not exceed the specified threshold. The limit is Rs 7 lakh under the new tax regime and Rs 5 lakh under the old regime. If your income falls within these thresholds, your tax liability will be reduced to zero. The Finance Act 2019 raised the tax rebate threshold under section 87A to Rs 12,500 for individuals earning Rs 5 lakh or less in the old tax regime. In the new tax regime, the tax rebate amount is now Rs 25,000 for those earning Rs 7 lakh or less. Effective July 5, 2024, the rebate under section 87A was not applicable on certain special rate incomes when filing income tax returns (ITR). This includes short-term capital gains on equity shares or equity-oriented mutual funds taxed at 15% under Section 111A. The Bombay High Court order stated: \"The respondents have unilaterally disabled assessees from claiming rebate under Section 87A after 5 July 2024 by modifying the utility software for filing income-tax returns. As a result, if the returns are filed by the assessees using the software of the respondents after 5 July 2024, they are unable to claim the rebate.\" What was the demand? Senior advocate Percy Pardiwala, representing the petitioner, contended that the software modifications made by CBDT were capricious and infringed upon the statutory rights of taxpayers. The Public Interest Litigation (PIL) highlighted that the Section 87A rebate is a fundamental entitlement under the Income Tax Act, which cannot be diminished through technical alterations. Furthermore, the petition sought the court's intervention to instruct the Central Board of Direct Taxes (CBDT) to permit affected taxpayers to submit revised returns under Section 139(5) of the Act in order to retroactively claim the rebate. What did the Bombay HC say? The recent modifications to the utility software of the Income Tax Department, as noted by the Bombay High Court, have hindered eligible taxpayers from availing of the Section 87A rebate. This rebate permits individuals with taxable incomes up to Rs 7 lakh to bring down their tax dues to zero. The bench, headed by Chief Justice Devendra Kumar Upadhyaya and Justice Amit Borkar, pointed out that the software updates introduced on July 5, 2024, restricted certain taxpayers from claiming the rebate. The judges emphasized that such procedural changes go against the legislative purpose of the rebate and place an unjust burden on taxpayers. In its order dated December 20, 2024, the Bombay High Court said: \"…By way of interim relief, the respondent, Central Board of Direct Taxes is hereby directed to forthwith issue requisite notification under Section 119 of the Act extending the due date for e-filing of the income-tax returns in relation to the assessees who are required to file a return of income by December 31, 2024, at least to January 15, 2025. This extension is to ensure that all taxpayers eligible for the rebate under Section 87A are afforded the opportunity to exercise their statutory rights without facing procedural impediments.” What did the Income tax department say The changes made by the Income Tax Department were deemed necessary to address specific issues with rebate claims and to ensure compliance with legal provisions. The court, however, rejected this reasoning, stating that administrative adjustments should not take precedence over the substantive rights guaranteed by legislation. \"A paradoxical situation happened post July 5, 2024. Taxpayers who filed their ITR through the official utility were denied the benefit of claiming Rebate u/s. 87A for various special rate incomes, including short-term capital gains on equity shares or equity oriented mutual funds taxable at 15% under Section 111A. Once the ITR filing deadline was over the tax department started sending defective notices under section 139(9) for claiming Rebate for such specified tax cases. This was the main issue which created a problem. A defective notice would mean that the original ITR will get accepted only if the defect is cured. Owing to this, the tax-payers were indirectly forced to give up on the claim of 87A and pay the difference amount of tax,\" said Kinjal Bhuta, Secretary, Bombay Chartered Accountants' Society (BCAS). \"However, now due to this Bombay High Court Judgement, taxpayers who filed a ITR by forgoing 87A in response to the defective notice can now file a revised ITR claiming the tax rebate under section 87A before the extended due date of 15th January, 2025. The issue still is not resolved for those taxpayers who took no action after getting the defective ITR notice for claiming section 87A rebate. These taxpayers as of now seem to have only option of filing a belated ITR same as those who did not file any ITR, but they may be disadvantaged as they may have to forgo certain deductions and losses,\" he added."
    },
    {
        "id": 8,
        "url": "https://m.economictimes.com/news/economy/foreign-trade/fieo-seeking-govt-support-to-boost-us-exports-amid-threat-of-high-tariffs-on-china/articleshow/116632205.cms",
        "title": "GSP restoration, export strategy, easier documentation for export schemes: FIEO asks",
        "info": "New Delhi: India’s apex exporters’ body Federation of Indian Export Organisations (FIEO) has sought restoration of the Generalised System of Preferences (GSP) for duty-free imports of Indian goods into the US as it expects leather, steel and plastics exports to benefit from it.It has also drafted a strategy to increase exports to the US wherein it has identified five sectors- apparel, electronics, toys, footwear and organic chemicals- as focus areas that could help capitalise on opportunities arising with the US president-elect Donald Trump’s threat to impose high tariffs on Chinese goods.Besides, the body has urged the government to provide financial assistance for Indian exporters to participate in exhibitions there.“Capacities are being built as big factories are coming up in the country. We have to increase our presence in the US,” said FIEO vice president Israr Ahmed.Emphasising the need for aggressive promotion and visibility in the US market, he said: “We are asking for more fundings under the Market Access Initiatives scheme to seize the opportunities. The scheme should focus on the US for at least three years”.The commerce and industry ministry has reached out to industry seeking their offensive interests in the US before Trump assumes office on January 21. Services export to the US in the Trump administration will be more challenging, exporters expect.Ahmed said that many companies are leaving China and a lot of apparel firms are shifting base to India from Bangladesh due to political uncertainties there.“There is uncertainty in Bangladesh and we give stable environment to source products,” he said.However, he said that liquidity is a major challenge for exporters and that export finance had decreased.GSP restorationThe Trump administration discontinued India’s GSP benefits in 2019 amid trade talks and almost $8-9 billion Indian exports were eligible for low or zero-duty.The two sides had worked to complete a limited trade deal but failed to finalise it.“GSP restoration can be a major benefit for us especially in leather, steel and plastics,” said Ajay Sahai, director general, FIEO.The US’ loss of revenue was around $200 million due to the withdrawal.Export schemesFIEO has urged the government to relax the requirement of making payments to MSMEs within 45 days of buying goods and services, besides a five-year extension of interest equalisation scheme.It is also discussing with the commerce department the issue of documentation if benefits under the Remission of Duties and Taxes on Exported Products (RoDTEP)to an exporter cross Rs 1 crore. It is keyto deal with countervailing duty cases on domestic products over the RoDTEP scheme.The move is important as countervailing or anti-subsidy duties were imposed on certain domestic units by the US and the EU.Trump has threatened to impose new tariffs on Mexico, Canada, and China as soon as he takes office.FIEO is also pushing for the government extension of the interest equalisation scheme for pre and post shipment rupee export credit."
    },
    {
        "id": 9,
        "url": "https://www.businesstoday.in/markets/company-stock/story/asian-paints-shares-hit-fresh-52-week-low-q2-earnings-price-targets-458520-2024-12-26",
        "title": "Asian Paints shares hit fresh 52-week low, down 18% since Q2 earnings; what's next?¬† - BusinessToday",
        "info": "Shares of Asian Paints Ltd slipped to their 52-week low in early deals amid a rally in the broader market today. Asian Paints stock slipped to Rs 2,262.50 on BSE. Total 0.21 lakh shares of Asian Paints changed hands amounting to a turnover of Rs 4.87 crore. Market cap of Asian Paints slipped to Rs 2.19 lakh crore. Asian Paints shares have a one-year beta of 0.5, indicating very low volatility during the period. In terms of technicals, the relative strength index (RSI) of Asian Paints stands at 21.6, signaling it's trading in the oversold zone. Asian Paints stock is trading lower than the 5 day, 10 day, 20 day, 30 day, 50 day, 100 day, 150 day and 200 day moving averages. In the last three months, the Asian Paints stock has slipped 31%. The stock has turned weak after the firm reported its Q2 earnings on November 9. Since then, the stock has fallen 18.29%.  JPMorgan has downgraded Asian Paints to 'underweight' from 'neutral' and cut its price target to Rs 2,400 from Rs 2,800 earlier. It said domestic decorative paint volumes declined for the first time in the past decade, excluding the Covid-19 pandemic. \"While broader demand weakness has weighed on the overall industry growth in recent quarters, Asian Paints is lagging peers with differential expanding further in the second quarter both on the revenue and earnings front,\" said the foreign brokerage.  Global brokerage Jefferies has a 'underperform' rating on Asian Paints with a price target of Rs 2,100. Jefferies said it remained concerned on competition which has also blurred the future outlook for the company.  Brokerage Prabhudas Lilladher has a reduce call on the stock and trimmed its price target to Rs 2230.  \"We cut FY25/FY26/FY27 EPS by 16.4%/18.4%/18.3% given 24.4% decline in 2Q colidated PAT and muted outlook for 2H25. Asian Paints volume decline of 0.5% indicates some loss of market share as most competitors have grown volumes by 3-4%. While it is too early to cite any impact of Birla opus on the market dynamics, competitive intensity is on the rise, which has also forced Asian Paints to give higher discounts to trade to sustain their retrun on investment. We believe Asian Paints will sustain more incentives to trade as this has been its biggest strength over the years. While we expect sequential volume recovery to set in, Asian Paints guidance for 2H seems weak given high base and heightened competition. We believe regaining lost share might be tough given changed competitive dynamics,\" said Prabhudas Lilladher.   \"However, we expect situation to improve from FY26 onwards and factor in 6.7% revenue growth and 5.6% PAT growth (impacted by higher capex and depreciation) over FY25-27. APNT trades at 51.5x FY27 EPS. We cut DCF based-target price to Rs 2230 (Rs 2605 earlier). Re-Rating seems a long drawn affair given likely impact of Birla opus and rich valuations. Retain Reduce,\" added the brokerage.  Asian Paints' consolidated net profit slipped 42.4% in the September 2024 quarter year-on-year (YoY) to Rs 694.6 crore against Rs 1,205.4 crore posted in the corresponding quarter of the previous fiscal year.    Sales fell 5.3% to Rs 8,003 crore in Q2 from Rs 8,451.9 cr in the corresponding quarter of the previous fiscal. EBITDA slipped 27.8% to Rs 1,239.5 crore in the last quarter from Rs 1,716.2 crore. Margins fell 480 bps to 15.5% on a YoY basis."
    },
    {
        "id": 10,
        "url": "https://www.businesstoday.in/india/story/delhi-assembly-elections-2025-supporting-aap-in-2013-ajay-maken-on-congress-decline-calls-arvind-kejriwal-farziwal-458504-2024-12-26",
        "title": "'Supporting AAP in 2013...': Ajay Maken on Congress' decline in Delhi; calls Arvind Kejriwal 'Farziwal' - BusinessToday",
        "info": "Senior Congress leader Ajay Maken on Wednesday said that the grand old party's decision to support the Aam Aadmi Party (AAP) in 2013 led to the Congress' decline in Delhi. Maken added that there is a need to rectify the repeated mistake of aligning with the AAP in the Lok Sabha elections 2024. Maken's remarks came at a press conference while releasing a White Paper on the Black Deeds of both AAP government and the Bharatiya Janata Party (BJP)-led Central government.  \"I feel that today the plight of Delhi and that the Congress got weakened here is only because of the fact that we supported AAP for 40 days in 2013,” Maken, who is the president of Delhi Congress, said. The veteran Congress leader further said had the grand old party not helped Kejriwal in forming the government in 2013, Delhi residents might not have faced the challenges they faced. In 2013, Arvind Kejriwal scripted history by defeating popular CM Sheila Dikshit in her New Delhi assembly seat. Kejriwal won just 28 seats, slightly behind the BJP.  The Congress-AAP tie up lasted only for 49 days. In the 2015 assembly elections, the AAP won 67 of 70 seats and the BJP was reduced to just 3 seats. The Congress drew a blank in this assembly election.  Moving ahead, Maken criticised Arvind Kejriwal, saying his party came to power riding on the anti-corruption agitation and failed to set up Janlokpal in Punjab where the AAP is in government. He furthermore went onto say: \"If there is one word to describe former Delhi chief minister Arvind Kejriwal here then it would be 'Farziwal'.\" The Delhi Congress chief alleged that money was spent on renovating the Chief Minister's official residence by the AAP and constructing the Central Vista by the Centre during the COVID-19 pandemic when common people were suffering.  He added the pension for elderly was stopped due to the fighting between the AAP government in Delhi and the Central government.  Maken also went onto call Kejriwal an \"anti-national\" who is in \"ideological\" support of the BJP on issues such as the Uniform Civil Code, abrogation of Article 370 and the Citizenship (Amendment) Act.  He also asked how can one rely on Kejriwal who is only driven by \"personal ambition\"."
    },
    {
        "id": 11,
        "url": "https://www.businesstoday.in/india/story/haryana-defeat-congress-fact-finding-panel-releases-interim-report-blames-458326-2024-12-23",
        "title": "Haryana defeat: Congress 'fact-finding' panel releases interim report, blames... - BusinessToday",
        "info": "A Congress fact-finding committee has blamed the BJP and the Election Commission (EC) for its surprise defeat in the Haryana Assembly elections held in October. The collusion, the committee claimed in its interim report, led to the rigging of polls through Electronic Voting Machine (EVM) hacking and misuse of official machinery. The eight-member panel, led by former minister Karan Singh Dalal, alleged that EVMs were hacked in at least 27 constituencies, primarily in urban areas, The Indian Express reported on Monday. \"The BJP did not hack EVMs in entire Haryana but only in urban constituencies. In rural areas, people generally know which party the others have voted for. It is only in urban areas that the political choices of people are not known exactly,” Dalal told IE. After the election results on October 8, the Congress submitted a list of 20 Assembly constituencies to the EC, citing irregularities in the vote-counting process. Of these, the BJP had won 18 seats. The EC had dismissed the allegations, stating they created a \"smoke of generic doubt over the electoral process.\" On Monday, the Congress reiterated these accusations, raising suspicions about \"EVM batteries showing 99% power at the end of polling day.” Dalal questioned the EC's explanation, saying, \"The EVM is like a calculator, and its battery discharges on use. However, the EC is saying these batteries are unique, which gain power upon use.\" Dalal further criticised the EC for not publishing the total number of votes polled by candidates. He pointed to discrepancies in polling data, noting that by 7 pm on polling day, the turnout was 61.19%, with 1.24 crore votes polled. This figure was later revised to 65.65% at 11:45 p.m. and then to 67.9% the following morning. “But the EC did not give the exact number of votes,” he said. Highlighting inconsistencies in the BJP's vote count, Dalal said, \"There are 2.03 crore registered voters in Haryana. As per the EC, the total turnout was 67.90%, meaning 1.38 crore votes were polled. If the BJP’s vote share was 39.94%, they should have got 55.19 lakh votes. But the EC website shows the BJP got 55.48 lakh votes. This means more votes were polled and the Congress would have also got more votes. But there is no increase in Congress vote share, affecting the party in at least eight-nine constituencies that we lost.\" According to IE, Dalal also questioned the disparity in BJP's winning margins across constituencies. \"In 44 constituencies, of which the BJP won 37, their strike rate was 84.9%. In 46, the BJP won 11 with a strike rate of 23.91%. How could there be such a stark difference?\"  Despite losing ground in the Lok Sabha elections, the BJP made a remarkable comeback, securing 48 of the 90 Assembly seats and forming the government for a third consecutive term. The Congress, which had gained five Lok Sabha seats just six months ago, was widely expected to win in Haryana but was stunned by the BJP's return."
    },
    {
        "id": 12,
        "url": "https://www.businesstoday.in/magazine/deep-dive/story/nandini-piramal-steering-piramal-pharma-towards-global-leadership-with-innovation-and-resilience-453587-2024-12-24",
        "title": "Nandini Piramal: Steering Piramal Pharma towards global leadership with innovation and resilience",
        "info": "As chairperson of Piramal Pharma Ltd (PPL), Nandini Piramal says she has worked towards cultivating a culture of innovation and diversity. “We have expanded globally, enhanced our manufacturing capabilities, and strengthened our focus on the contract development and manufacturing organisation (CDMO) business and the consumer product division,”she says. Piramal believes in empowering her teams. “My ongoing focus is on building a resilient, forward-thinking organisation that can compete with global pharma brands,” she says. Leading a company in the rapidly changing pharma sector comes with its challenges. She identifies several hurdles, including regulatory changes, supply chain disruptions, and shifts in market demand. “These challenges require quick adaptation,” she says. “To address them, we have strengthened our operational resilience, invested in technology, and cultivated a culture of agility.” Under her, PPL has seen improvement in key financial metrics. It reported revenues of Rs 8,171 crore in FY24, a 15% growth year-on-year, while its Ebitda increased by 61% to Rs 1,372 crore. PPL’s success relies on a commitment to long-term, sustainable growth, says Piramal. “Our key strategies are continuous investment in innovation, both in our R&D and digital capabilities, and maintaining a patient-first approach in everything we do,” she says, adding that PPL has also diversified its portfolio across complex generics, CDMO, and consumer healthcare to remain agile and meet evolving market needs."
    },
    {
        "id": 13,
        "url": "https://timesofindia.indiatimes.com/city/delhi/on-track-40km-of-new-underground-corridors/articleshow/116640206.cms",
        "title": "On Track: 40km Of New Underground Corridors",
        "info": "New Delhi: Delhi Metro Rail Corporation is constructing 40.1km of new underground corridors as part of its PhaseIV expansion, under which 86km of new lines are being laid across five corridors.Under Phase-IV expansion, Delhi Metro is building three priority corridors: Janakpuri West-RK Ashram; Majlis Park-Maujpur; and Aerocity-Tughlaqabad. The work on two other corridors — Inderlok-Indraprastha and Lajpat Nagar-Saket G block — is in the pre-tender stage. However, Lajpat Nagar-Saket G block and Majlis Park-Maujpur have no underground section. The alignment of the Tughlaqabad-Aerocity (Golden Line) will pass below 17 pairs of railway tracks between the Tughlaqabad and Tughlaqabad Railway Colony stations. This will be a major engineering challenge.\"While Delhi Metro lines passed below railway tracks in the past, this will be the first time that the alignment will pass below so many railway lines. The breadth of the stretch of railway lines which will be crossed by the Delhi Metro lines will be about 110 metres,\" said a senior DMRC official.Currently, seven tunnelling drives have been completed across Phase-IV corridors and nine drives are in progress at various locations. These underground corridors have the longest tunnelling drives undertaken in DMRC's history in Phase-IV. The 3km tunnelling drive from Derawal Nagar-Pulbangash on RK Ashram-Janakpuri West on Magenta Line in Sept this year was the longest in the DMRC network. It was followed by a 2.65km tunnelling drive from Tughlaqabad Airforce Launching Shaft to Maa Anandmayee Marg on Golden Line.\"In contrast, under Phase-III expansion, a 1.6km-long tunnel connecting Ashram and Nizamuddin was the longest. Another long stretch was a 1.25km stretch from Vasant Vihar to Munirka,\" said a DMRC official. DMRC generally constructs the underground Metro stations using conventional cut-and-cover technology while the tunnels are built with the help of tunnel boring machines (TBMs). \"This is a major engineering challenge since the underground corridors are passing through crowded residential as well as commercial areas in Sadar Bazar, Nabi Karim, Mehrauli-Badarpur Road, Ajmal Khan Park, among others,\" said an official.DMRC is monitoring the tunnelling work closely and necessary instrumentation has been done to ensure the condition of the buildings in these areas is regularly monitored, he added.A TBM is used to excavate tunnels with a circular cross-section through a variety of soil and rock strata. TBMs have revolutionised the way tunnelling work is done as tunnels can now be bored without disturbing structures on the surface."
    },
    {
        "id": 14,
        "url": "https://timesofindia.indiatimes.com/sports/cricket/india-in-australia/what-did-sam-konstas-say-on-the-virat-kohli-shoulder-bump-altercation/articleshow/116667386.cms",
        "title": "What did Sam Konstas say on the Virat Kohli shoulder-bump altercation?",
        "info": "A physical altercation between Virat Kohli and Sam Konstas marked the opening morning of the fourth Test between Australia and India at the Melbourne Cricket Ground on Thursday.India vs Australia 4th Test LiveNineteen-year-old debutant Konstas played a daring innings, scoring 60 off 65 balls. He shared an 89-run opening partnership with Usman Khawaja.Sam Konstas on facing Jasprit Bumrah and comparisons with Shane WatsonKonstas's innings ended when he was given out lbw to Ravindra Jadeja.The on-field tension escalated at the end of the 10th over. A shoulder-to-shoulder collision occurred between Kohli and Konstas.Konstas's aggressive batting style had drawn comments from the Indian fielders, adding to the charged atmosphere.Following the collision, Kohli and Konstas exchanged words. Kohli then began to approach Konstas again.Usman Khawaja intervened, stepping between the two players. He calmed the situation by patting Konstas's arm and putting a friendly arm around Kohli.“Virat’s walked one whole pitch over to his right and instigated that,” said Ricky Ponting in commentary for Channel Seven. “It’s Kohli that goes off line and he walks into Sam,” he added.After his stay in the middle ended, Konstas spoke to the host broadcaster and was questioned about the incident. He said, \"I think the emotions got to both of us. I didn't quite realise, I was doing my gloves, then a little shoulder charge, but it happens in cricket. Whatever happens on the field, stays on the field,\" to brush things off.Earlier in the match, Konstas displayed both nerves and audacity. He played and missed four times in the first over, bowled by Jasprit Bumrah.However, in Bumrah's fourth over, Konstas showcased his fearless approach. He executed three reverse scoops over the slips, resulting in two fours and a six.At lunch, Khawaja was 38 not out and Marnus Labuschagne was on 12 with Australia 112/1.Australian captain Pat Cummins had opted to bat first on a pitch with a green tinge.The five-match series is currently tied at 1-1 following a rain-affected draw in Brisbane.Australia made two changes to their team from the drawn Brisbane Test.Scott Boland replaced Josh Hazlewood, who sustained a calf strain. Konstas came in for struggling opener Nathan McSweeney.India selected a bowling-heavy lineup, including offspinner Washington Sundar, providing them with six bowling options.The series carries significant weight as Australia and India are currently ranked second and third respectively in the World Test Championship standings.Both teams are vying for a spot in the World Test Championship Final scheduled for June 2025 at Lord's.South Africa, currently ranked first, are concurrently playing a two-Test series against Pakistan, also commencing on Thursday.The fifth and final Test between Australia and India is set for January 3 at the Sydney Cricket Ground."
    },
    {
        "id": 15,
        "url": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/exclusive-father-played-with-joe-roots-dad-son-to-partner-virat-kohli-jacob-bethells-rise-to-rcbs-rs-2-6-crore-star/articleshow/116604857.cms",
        "title": "Exclusive | Father played with Joe Root‚Äôs dad, son to partner Virat Kohli: Jacob Bethell‚Äôs rise to RCB‚Äôs Rs 2.6 crore star",
        "info": "NEW DELHI: The cricketing fixture between Rugby School and Marlborough College, two of Britain’s most historic independent schools, is a cherished tradition in the English sporting calendar. Dating back to the mid-1800s with the only recent interruption being the COVID-19 pandemic, which disrupted life as we knew it, this storied rivalry holds a special place in the hearts of cricket buffs across Wiltshire and Warwickshire.In 2021, during one such historic encounter, English cricket was on the brink of discovering what Indian spinner R Ashwin has recently described as a potential \"generational talent\". The player in question? None other than Royal Challengers Bengaluru's newest Rs 2.6 crore recruit, Jacob Bethell.Representing the shades of Rugby School, where he honed his cricketing skills after moving to the UK, Jacob Bethell chose the first innings of the annual two-day fixture to demonstrate his overall mettle. With a stunning knock of 202, he caught the attention of many, including Michael Powell, Rugby School’s Director of Cricket and a former Warwickshire captain.\"We had scored over 400 before tea on the first day, with Jacob contributing 200 of those runs. He was playing at a different level from everyone else that day. Then, he went on to take nine or ten wickets in the match as well. The way he went about his business was remarkable,\" recalled Michael during an exclusive interaction with TimesofIndia.com.Michael Powell, however, finds it hard to decide what is more remarkable — the dazzling innings from that fixture or the meteoric rise of young Jacob Bethell, now 21.Jacob Bethell: A 'generational talent' in the making?Over the past few months, Bethell has achieved what few can claim: making his ODI, T20I, and Test debuts within the span of just three months. Even more striking, he became the first English batter since Mike Gatting in 1978 to earn a Test cap without a first-class century to his name, showcasing the high regard in which England Cricket holds him.Coach Michael is a firm believes that his protégé Jacob is destined for greatness. Hailing from a family deeply rooted in cricket — his father and grandfather both being former professional cricketers — Jacob has justified his decision to leave the Caribbean and test his legacy with the willow in the UK.\"I took a call from a good friend of ours who was on a cricket tour in Barbados - a cricket tour that I had set up at my previous school in Scotland but had subsequently left. This friend, whose sons were in my boarding house because I was a housemaster there, said that there was a young boy, about 11 years old, who was smashing all their 17-and 18-year-old bowlers around Barbados at the moment. He used to work with the boy's father, Graham Bethell, and that was my first point of contact,\" shared Michael.\"He put me in touch with Graham and Giselle Bethell, Jacob's parents, and we started a dialogue. Eventually, they brought Jacob to Rugby School. I then took him over to Edgbaston, to Warwickshire, and introduced him to the academic director, Paul Greetham. That’s how it all began. They explored quite a few schools in the UK because Jacob had trained with the Franklyn Stephenson Academy before. Eventually, they decided on Warwickshire and Rugby School.\"Recalling his first meeting with Jacob around a decade ago, the former Warwickshire cricketer continued, \"Jacob was only 11 years old when he first came to visit. He met me, and we had a great afternoon looking around the school. I had already seen a few videos that had been sent to me, including one that has since become quite famous on Instagram — showing him pulling shots as a very young 10-year-old batsman [batter] in the West Indies.\"Caribbean roots, cricketing dreamsBarbados-born-and-raised, Jacob is known for being deeply family-oriented. The 21-year-old manages to carve out time for his father Graham, mother Giselle, and sister Rebecca, who followed her brother's footsteps and joined Cheltenham College a year later, marking a shared commitment to education and opportunity in the UK.The siblings spent around 32 weeks annually in the UK, dedicating the rest of the year to cherished family moments back home in Barbados.The cricketing blood in Jacob’s veins runs deep, with his father Graham spending many years playing for Sheffield Collegiate in England, where he was teammates with Joe Root’s father, Matthew Root. Meanwhile, his grandfather, Arthur, was the former captain of the Barbados cricket team in the West Indies.\"When he was growing up as a youngster, he probably had a bat in his hand by the age of three. Just the way he operated as a young player at the time — in all aspects, batting, bowling, and fielding — was remarkable. He had a really natural bat swing, as if the bat had been in his hands since his earliest days.\"Growing up in Barbados, cricket was in the family and in his genes. He lived an outdoor life in Barbados, blessed with good weather. At home, he had a lovely little setup with a rope and a ball at the end of it, and he would spend hours swinging and hitting the ball. His bat swing was incredibly natural,\" noted Michael.The evolution of Jacob Bethell: From classy Test batter to explosive white-ball cricketerUnderstood to be a natural athlete, Jacob grew up immersed in a variety of sports — surfing on the beaches of Barbados, playing cricket in the sand, and enjoying golf, tennis, and squash. His innate sporting talent has likely been a key factor in his seamless transition from a graceful stroke-maker in Test cricket to a dynamic power-hitter in white-ball formats.\"His early setup and approach to batting were very much Test-match-oriented. As a young player, he was very respectful in how he played and left the ball, yet positive in how he looked to score. However, when he was younger, he didn’t have the power he has now. That’s something he’s gained over the last four or five years,\" explained his childhood tutor.Stadium Walkthrough series: Inside The GabbaFrom a young age, Jacob was incredibly stylish, particularly excelling against short-pitched bowling, having grown up facing tall West Indian bowlers who frequently bowled bouncers, which helped him develop his ability to handle the short ball.\"I remember the first time I saw him bat — a tall West Indian lad ran in, bowled a bouncer, and Jacob pulled it away. Not many 9-or 10-year-olds could do that. He had a real fluency and fluidity in his bat swing, with great energy and rhythm in how he picked up and swung the bat. He handled taller, faster young West Indian bowlers remarkably well,\" Michael said.\"His game has since developed to adapt to the modern game, particularly the white-ball format. Now, as we’ve seen more recently, he can hit the ball out of the park. When I first met him, he struggled to hit the ball off the square or in front of the wicket. He was fantastic with the pull shot and a great sweeper of spin bowling but lacked the physical power to pierce gaps in front of the wicket,\" he added, \"Of course, that power develops with time as a young player grows, and now he’s a strong, athletic young man. He has the ability to hit 100-metre sixes just as easily as he can play the softer game: rotating and manipulating the ball with finesse.\"What can RCB expect from young Bethell?With RCB stacking up their top-order with right-handers, Jacob Bethell, as a left-hander, could be the perfect solution. With Virat Kohli and Phil Salt likely to open the innings, Bethell could slot in at No. 3, with Rajat Patidar following at No. 4, creating a balanced lineup. This versatility, along with his handy slow left-arm orthodox bowling and wicket-keeping skills, has many RCB fans predicting that the English talent will be a regular fixture in the playing XI.\"To me, he always looked like a top-order batsman. He thinks like a top-order batsman. The nature of T20 cricket, The Hundred, and white-ball cricket, in general, has pushed him to develop his skills further. Fundamentally, his technique is built for Test cricket, but he’s also developed into a very potent white-ball cricketer. You could class him as an all-rounder or a top-order batsman who bowls very effectively, keeps wicket and fields brilliantly,\" Michael told TimesofIndia.comIn terms of attitude, Michael thinks he is a natural leader. \"As a youngster, Jacob was in England's senior team very early on, and he’s always been a natural leader by example. He’s in a fantastic environment, surrounded by the likes of Joe Root, Ben Stokes, Brendon McCullum, and Marcus Trescothick, who have all performed at the highest level for extended periods. He has the benefit of learning from some of the best minds in the game,\" he added.\"For him to be put into the IPL auction, to be chosen, and to have the opportunity to play cricket in that environment is incredible. The IPL is the biggest league in the world, and now he has the chance to be around players like Virat Kohli,\" the man, who has seen Jacob blossom in front of his eyes, concluded.\"I know Jacob is made for this—he’s been working toward this his whole life. It’s an incredible opportunity for someone who has put in so much effort. I’m sure RCB fans will thoroughly enjoy watching him, as he’s looking forward to becoming part of the RCB family.\""
    },
    {
        "id": 16,
        "url": "https://timesofindia.indiatimes.com/sports/cricket/news/vinod-kambli-assured-of-all-possible-help-by-shiv-sena/articleshow/116650461.cms",
        "title": "Vinod Kambli assured of all possible help by Shiv Sena",
        "info": "NEW DELHI: Shiv Sena has stepped up to support former cricketer Vinod Kambli, who is presently receiving treatment at Aakriti Hospital in Thane. The OSD of deputy chief minister Eknath Shinde, Mangesh Chivate, met with Kambli and gave him a full assurance of the party's support and assistance. The player will receive a total of Rs 5 lakh in aid from the Shrikant Shinde Foundation.A Rs 5 lakh aid package has been announced and will be given out next week per Deputy Chief Minister Shinde's directives. Mangesh told the cricketer that MP Shrikant and Deputy CM Shinde would visit him and his family shortly and would do everything in their power to support him.Kambli, who played 17 Tests and 104 ODIs for India between 1993-2000, had made a rare public appearance recently when he attended the inauguration of legendary coach Ramakant Achrekar's memorial at the Shivaji Park in Mumbai.The former India cricketer, who has been struggling with health-related issues for quite some time, appeared frail and incoherent in his speech in the function which was also attended by his long-time friend Sachin Tendulkar."
    },
    {
        "id": 17,
        "url": "https://timesofindia.indiatimes.com/sports/cricket/news/vinod-kambli-is-fine-says-his-friend-couto-after-ex-cricketer-is-hospitalized/articleshow/116613381.cms",
        "title": "Vinod Kambli is fine, says his friend Marcus Couto after ex-cricketer is hospitalized",
        "info": "VADODARA: In a huge respite to Vinod Kambli’s fans, his old, cricketing friend, former first-class umpire Marcus Couto has assured that the former India cricket star, who was admitted to a hospital in Thane in Mumbai on Saturday due to a deterioration in his health is \"fine\" now, and \"recovering well.\"\"Vinod is doing fine now. He is recovering well. He is being treated for Urinary tract infection, ‘Hypokalemia’ (a condition which occurs when the amount of potassium in the blood is lower than normal), and complications arising from an old heart stroke (in 2013). I was with his brother ‘Viru’ Kambli last night at the hospital, and as usual, we were talking about his old cricketing memories,\" Couto told TOI from Mumbai.ALSO WATCHJasprit Bumrah breathes fire in the nets at MCGInterestingly, in a magnanimous gesture, Dr Shailesh Thakur, a die-hard fan of Kambli, the Akruti Health City Hospital in Thane where the 52-year-old has been admitted has decided to foot his treatment bills. The hospital even sent an ambulance to his Bandra residence to bring him to its Kalher facility. Thakur is the director at the hospital.Couto isn't in favour of Kambli being discharged from the hospital soon. \"I told them to treat him at the hospital for a month as he has multiple health complications. Since someone is ready to spend money on his treatment, why not? I wish him a speedy recovery,\" Couto added.Couto's sole concern for his friend is the continuous flow of the local fans visiting the hospital to meet the ailing ex-India cricket star, which puts him danger of catching an infection. \"I had a long conversation with his doctor, Arfat Shaikh, about Vinod's treatment and ended it with a request to stop the non-stop flow of local villagers from visiting him in the ICU of the hospital due to the risk of infection for him as they are clicking pictures, making videos, and indulging in handshakes with him,\" Couto said.Couto, along with his brother Ricky went to meet Kambli at the former India batter's Jewel Cooperative Society in Bandra after his video of not being able to walk properly surfaced in August this year.Kambli, who played 17 Tests and 104 ODIs for India between 1993-2000, had made a rare public appearance recently when he attended the inauguration of legendary coach Ramakant Achrekar’s memorial at the Shivaji Park in Mumbai.The former India cricketer, who has been struggling with health-related issues for quite some time, appeared frail and incoherent in his speech in the function which was also attended by his long-time friend Sachin Tendulkar."
    },
    {
        "id": 18,
        "url": "https://timesofindia.indiatimes.com/sports/more-sports/shooting/khel-ratna-row-ministry-manu-bhaker-look-to-strike-conciliatory-note/articleshow/116646083.cms",
        "title": "Khel Ratna row: Ministry, Manu Bhaker look to strike conciliatory note",
        "info": "NEW DELHI: The sports ministry and double Olympic medallist Manu Bhaker struck a conciliatory note on Tuesday over the latter's surprise exclusion from the list of recommended athletes for this year's Major Dhyan Chand Khel Ratna award. The snub to the shooter created a huge controversy, leading to severe criticism of the 12-member selection committee.While Manu's father Ram Bhaker continued his tirade against the ministry and the committee for ignoring his daughter's credentials for the country's highest sporting honour with the shooter's personal coach Jaspal Rana, also joining the raging debate, the 22-year-old athlete caught in this storm broke her silence over the issue and admitted on Tuesday that there was a \"lapse\" on her part in filing the nomination.In what looks like an effort to end the controversy, Manu posted a statement on 'X' where she said that awards and recognitions keep her motivated but aren't her only goal. \"With regards to the ongoing issue for my nomination for the most prestigious Khel Ratna award, I would like to state that as an athlete my role is to play and perform for my country. I believe there has been a lapse, maybe on my part, while filing for the nomination which is being corrected,\" Manu wrote.\"Awards and recognition keeps me motivated but are not my goal. Irrespective of the award, I shall remain motivated to win more medals for my country. It is a request to everyone, please do not speculate on this,\" she said.Manu had been applying for the Khel Ratna for the last three years - 2021-2023 - but her achievements weren't considered despite the shooter winning several medals at major multisport events. It's been learnt that Manu was unhappy with the snub meted out to her by different awards committees and this could be a reason for her not applying this time.Despite that, the selection panel should have taken cognizance of her achievements as a shooter over the years, including the two Paris Games medals. It's been learnt that the ministry is actively considering nominating her name for the Khel Ratna by using its executive powers vested in the provisions of the National Sports Day awards scheme.Rana, who returned to coach Manu exactly a year before the Paris Olympics, held the ministry, Sports Authority of India (SAI) and National Rifle Association of India (NRAI) responsible for ignoring his ward's credentials. \"I will hold all of them responsible. Why should anyone even say Manu did not apply? Her name should have been there automatically. Don't the people at the helm know who Manu Bhaker is? This humiliation might just affect her progress,\" Rana was quoted as saying by a news agency.HARVINDER UNHAPPY AT THE SNUBIndian archer Harvinder Singh, who made history at the Paris Paralympics by clinching a gold medal in the men's individual recurve open, has expressed his annoyance over the Khel Ratna snub. He became the first archer from the country to win gold in either the Paralympics or the Olympics and also achieved the distinction of being the only archer to secure medals in consecutive Paralympic editions. \"Discrimination in sports. Tokyo 2020 Paralympic gold medallists were awarded the Major Dhyan Chand Khel Ratna Award, but what about Paris 2024 Paralympic gold medallists? Same competition, same gold, same pride, why not the same award?\" he posted on X. In 2021, Tokyo Paralympics gold medallists Avani Lekhara, Sumit Antil and Pramod Bhagat were all awarded the Khel Ratna."
    },
    {
        "id": 19,
        "url": "https://timesofindia.indiatimes.com/sports/more-sports/shooting/manu-bhaker-admits-lapse-on-her-part-while-filing-khel-ratna-nominations-says-awards-are-not-my-goal/articleshow/116629909.cms",
        "title": "Manu Bhaker admits lapse on her part while filing Khel Ratna nominations, says 'awards are not my goal'",
        "info": "NEW DELHI: Double Olympic bronze-medallist Manu Bhaker on Tuesday acknowledged a lapse on her part while filing nominations for this year's National Sports Awards, amidst controversy regarding her omission from the Khel Ratna awardees list.Manu holds the distinction of being independent India's first athlete to secure two medals in one Olympic Games.'My fault that I encouraged her into sports': Manu Bhaker's father slams government over Khel Ratna snubFollowing the sports ministry's intervention for damage control after the selection committee's surprising decision to exclude her nomination, the 22-year-old shooting champion took to social media to explain her stance.\"With regards to ongoing issue for my nomination for the most prestigious Khel Ratna award -- I would like to state that as an athlete my role is to play and perform for my country.\"I believe there has been a lapse, maybe on my part while filing for the nomination which is being corrected,\" Bhaker wrote on X.Manu emphasised that her primary focus remains on performance, regardless of recognition.\"Awards and recognition keeps me motivated but are not my goal,\" she stated.\"Irrespective of the award I shall remain motivated to win more medals for my country. It is a request to everyone, please do not speculate on this,\" she expressed.This statement followed criticism from her coach Jaspal Rana and father Ramkishan Bhaker, who criticised the sports ministry and selection committee for disregarding her significant achievements.Her Paris Olympics success includes bronze medals in both the 10m air pistol individual and 10m air pistol mixed team competitions partnering with Sarabjot Singh."
    },
    {
        "id": 20,
        "url": "https://timesofindia.indiatimes.com/blogs/gen-zedits/glitches-happen-what-next/",
        "title": "Glitches happen, what next?",
        "info": "Imagine planning for an 8-day trip and ending up stuck for 8 months. That’s what happened to astronaut Sunita Williams. She and her teammate Butch Wilmore went to the International Space Station (ISS) for a quick mission, but technical problems kept them up there way longer than planned. Being stuck in space might sound scary, but Sunita is surprisingly cool about it. She even sent Diwali greetings, voted in an election, and wore a Santa hat to celebrate Christmas! Her husband says space is her happy place. Lucky her! But let’s face it—tech glitches aren’t always fun. Remember earlier this year when a Windows update caused the dreaded “Blue Screen of Death”? Computers everywhere froze, and people missed work deadlines, got late fees, or worse, got stuck at airports and hospitals. It wasn’t even something bad done on purpose, just a normal update gone wrong. Here’s the thing: we depend so much on technology now that even small hiccups can cause big problems. Think about it—our phones, cars, locks, and even fans are “smart” now. But what happens when these smart things fail us? We’re left feeling pretty helpless. So, what’s the solution? Going back to a life without tech isn’t realistic. (Honestly, who wants to write without autocorrect or sing without autotune?) The only way forward is to make our safety systems much stronger. Whether it’s NASA, Microsoft, hospitals, or payment apps, everyone needs to step up their game to ensure that when glitches happen, they don’t ruin everything. In a world where tech is everywhere, staying safe isn’t just smart—it’s essential!   Disclaimer Views expressed above are the author's own.    END OF ARTICLE"
    },
    {
        "id": 21,
        "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/stress-exhaustion-and-lack-of-personal-time-behind-all-the-glitz-and-glamour-is-bollywood-a-victim-of-untimely-burnout/articleshow/116630632.cms",
        "title": "Stress, exhaustion, and lack of personal time: Behind all the glitz and glamour, is Bollywood a victim of untimely burnout?",
        "info": "Earlier this month, actor Vikrant Massey sent social media into a tizzy, when he cryptically announced that he is quitting acting for good, that is, until time feels right. He also added that the next year (2025), will see him act in two movies, post which there will be a long lull. His long post read, \"Hello, The last few years and beyond have been phenomenal. I thank each and every one of you for your indelible support. But as I move forward, I realise it’s time to recalibrate and go back home. As a Husband, Father & a Son. And also as an Actor. So, coming 2025, we would meet each other for one last time. Until time deems right. Last 2 movies and many a years of memories. Thank you again. For everything and everything in between. Forever indebted.\"PollAn Actor’s Goodbye: How Do You Feel About This Announcement?However, a couple of days later, the actor revealed that his statement was misconstrued, and he in fact, is only taking a long break, and not hanging up his boots for good. The '12th Fail' actor said in a statement \"Acting is all I can do. And it has given me everything I have. My physical and mental health have taken a hit.I just want to take some time off, want to better my craft. I feel a sense of monotony at the moment. My post has been misinterpreted. That I am quitting or retiring from acting. I want to take some time off to focus on my family and health. I would be back when the time feels right.\"When Vikrant Massey Talked About Wanting To 'Do More' Ahead Of Retirement AnnouncementVikrant's post, which in turn turned out to be simply a break, opened the door to a larger conversation on over exhaustion, stress and burnout in the industry, which despite the fun and frolic (read money and fame), also brings in acute stress, poor time management, and lack of personal time. Here's navigating the high-pressure world behind the scintillating world of lights, camera, action...It is okay to not be okayFilm-maker Sanjay Gupta lauded Vikrant for having the guts to take this decision. He wrote, \"In 2008 Hansal Mehta left the film industry and Mumbai. Along with his family he shifted to a small village called Malawali in Lonavala. He recalibrated, reinvented himself and in 2012 came back with SHAHID his career best and has never looked back. 1/3\"He further continued, \"Do you realize the guts it takes to do that? To walk away from it all inspite of having a family to look after and the possibility of never directing again? It takes guts, resilience and an insane amount of belief in yourself. 2/3\"He added, \"In a way Vikrant Massey is doing the same. In these times of competition, insecurity, jealousy, rivalry it takes guts for an actor to take break and focus on his duties as a father, a husband and a son. He should be lauded not criticized. 3/3\"Stress taking a tollLater on, in a conversation with RJ Rohini, Vikrant opened up about feeling physically and mentally drained from doing four films a year. He said that he had started repeating himself, which was not okay with him as an actor. Vikrant added that he wanted to keep his creative oil burning, something he was unable to do till now.The actor spoke about his wife, Sheetal Thakur, and their son, Vardaan, who was born this year. He added that he hasn't even gone on a honeymoon with his wife, having constantly been caught up in work. Now, with the arrival of his son, the actor feels this is the perfect opportunity to retract, rejuvenate and take a break to spend time with his family.Talking about untimely burnout, Dr Harish Shetty, leading psychiatrist said, \"Burnout happens when one is not mindful about one's careers and slogs infinitely. Professionals who are effective plan their schedules with enough rest and joyous leisure, land up doing ecstatic work. For actors, the perception that they are under a million arc lights with a billion people gazing at them aggravates the situation....and burn out is hastened.\"Do actors have it worse?Talking about actors in particular, Dr Shetty said, \"Actors who work in double shifts and freshers, are more prone to psychological breakdowns. Many try to block or repair it by short term methods.... cannabis, alcohol, etc ....and fall from the frying pan to the fire....Actors who are insecure emotionally try to chew more than they can bite.\"He further added, \"Burnout leads to flawed irrational relationships because of faulty judgements ....and that causes earlier burnouts.\"Actor Vineet kumar singh of Mukkabaaz fame, says that stress is always there, sometimes it is not so visible. When asked what he does to alleviate the stress, he says that he takes frequent breaks to recalibrate and ponder over his life. He also says that if there is constant stress in one's life, it is best to just slow down, and get out out of that situation. He advises spending time with one's family and loved ones if there is excessive stress. Aamir Khan reveals he decided to quit the film industry during COVID-19 pandemic: My children and Kiran explained to me I am doing the wrong thingIndustry to blame or individual strength?A lot of talk has been going round that the cause of such mental and physical breakdown is the brutality of the industry, that does not give you a break. Actor Arjun Bijlani, a known face on TV and as a host, throws some light on the matter. He says, \"The industry is definitely competitive. There’s always pressure to deliver your best, stay relevant, and meet expectations. But at the same time, I believe competition pushes you to grow and improve. Yes, it can be stressful, especially when you’re juggling multiple projects or waiting for the right opportunity, but it’s all part of the journey.\"When asked how actors per se handle stress, he says \"Actors often find ways to channel their stress into something productive. For me, spending time with family, staying physically active, and practicing gratitude really helps. Many actors turn to meditation, yoga, or hobbies that allow them to disconnect and recharge. It’s important to maintain a balance. There have been moments when projects didn’t work out the way I hoped, or when I felt uncertain about the next step in my career. I believe what is written in my destiny will happen and things will fall in the right place. Patience is the key for everything,\" he adds.The veterans don't agreeHowever, a certain section of actors in the industry believe that while taking breaks is okay, burnout as a concept is not something that they understand. Actor Ronit Roy, who has acted on both TV and movies says, \"Unfortunately, I can only make an educated guess on the matter, since I do not understand the concept of burnout.\"He then went on to outline how hard he has worked to reach where he is now, and there are no shortcuts. He said, \"I have clocked in almost 5200 hours of programming in 10 years, that is almost the same amount of work people do in 25-30 years.\"He however, was quick to add that he has learned through a different generation, and everyone's struggles are different. \"Someone might want to concentrate on family affairs, someone might want to achieve a different passion and so on, so the priorities can differ for anyone, and that is okay.\"Not burnout, but poor time management?Ronit further says that no matter how caught up an actor is, no one shoots for 365 days a year. \"Usually the line is drawn at roughly 200 days, and the rest of the days, one is free to pursue what they want. It is another matter if someone wants to constantly be in the public eye, and is seen attending events/parties even after work. That will of course tire you out, emotionally and physically.\" Talking about himself, the actor said that for him, as soon as he packs up, it was family time, and he never carried work home.Actors who took a long break from movies (with or without burnout)Imran KhanThe nephew of Aamir Khan, Imran made his debut with the romcom Jaane Tu... Ya Jaane Na in 2008, and quickly became popular, even though his movies, barring a few, did not do well. Eventually, Imran, who by his own admission, was not too passionate about acting, decided to hang up his boots, to concentrate on his mental health, and pursue other interests. His last movie was Katti Batti in 2015. Though there has been a buzz that he might return to the movies, nothing is yet confirmed.Fardeen KhanThe actor, who made his debut in Janasheen in 2003, took a 14-year hiatus from acting, and his last release (till this year) was Dulha Mil Gaya in 2010. Battling drug allegations and weight gain, the actor eventually decided to take his health into his hands, and went through a massive transformation, eventually returning with Heeramandi: The Diamond Bazaar and Khel Khel Main.Anushka SharmaConsidered to be one of the highest paid actresses of today, Anushka had always maintained that when she decides to get married and plan a family, her priorities will change. Having tied the knot with cricketer Virat Kohli in 2017, she immediately cut back on work. The couple welcomed a daughter in 2021 and a son in 2024, and the actress has only picked up one project in the interim, called Chakda 'Xpress, that is yet to see the light of the day. Recently rumors are rife that she will quit Bollywood for good and move to London with her family.SrideviPost marriage to producer Boney Kapoor and daughters Janhvi and Khushi, the superstar took a long break to bring up her daughters, eventually returning with English Vinglish in 2012. She however, remained selective about her work, till her untimely death in 2018.This apart, superstars like Shah Rukh Khan, and Aamir Khan too, have taken a long break from movies in the past to recalibrate and rework on themselves."
    },
    {
        "id": 22,
        "url": "https://timesofindia.indiatimes.com/india/started-fading-away-beerbiceps-ranveer-allahbadia-recounts-near-drowning-incident-with-girlfriend-in-goa/articleshow/116669610.cms",
        "title": "‚ÄòStarted fading away‚Äô: 'BeerBiceps' Ranveer Allahbadia recounts near-drowning incident with girlfriend in Goa",
        "info": "NEW DELHI: YouTuber Ranveer Allahbadia, known online as BeerBiceps, was rescued from a near-drowning incident in Goa on Christmas eve. Allahbadia said that he and his girlfriend were swimming in the ocean when they were caught in an underwater current.Allahbadia recounted the experience in an Instagram post on Christmas. He and his girlfriend, both experienced swimmers, were struggling against the current. \"Merry Christmas to you all, from Goa. It's been the most eventful Christmas of my life. Gonna be very vulnerable in this write up. We're perfectly fine & well now. But yesterday at 6:00 pm or so, my girlfriend and I had to be rescued from a bit of a situation,\" wrote Allahbadia.\"We both love swimming in the open ocean. I've been doing this since I was a kid. But yesterday we got swept away by an underwater current. This has happened to me before but I've never been alongside a companion. It's easy to swim out of one alone. It's very hard to pull someone out with you,\" he said.\"After a 5-10 minute struggle, we called for help and were promptly rescued by a family of 5 swimming nearby. We're both good swimmers but the fury of nature is such that it WILL test your limits at some point. A casual, fun dip in the waves was interrupted by an underwater current that toppled both of us. The next thing we knew was that we were both struggling to stay afloat,\" the post further read.Sharing a number of photos from their trip, Ranveer narrated the ordeal and said, \"There was a point during the ordeal where I swallowed a lot of water and started fading away a little bit. That's when I decided to shout for help. Deep gratitude to the family of the IPS officer husband and IRS officer wife who saved us both. \"This experience left us feeling both blank as well as grateful. We felt the protection of God throughout the incident. As we moved into today's Christmas, we're simply full of gratitude for being alive. Almost feel like this one life experience has changed my perspective towards living,\" he said, not revealing his girlfriend's identiy in the post.\"Writing this because I've always shared these moments with you all. Full of emotion and gratitude today. A deep thank you and big hugs to each one of you reading this! \"I guess 2025 is going to be more blessed than ever. We lived for a reason! Merry Christmas to you all and to your families. Thank you God, for life!\" Ranveer said, ending the post."
    },
    {
        "id": 23,
        "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-holidays-2025-bse-nse-release-holiday-calendar-for-2025-check-full-list-of-month-wise-stock-market-holidays/articleshow/116593206.cms",
        "title": "Stock market holidays 2025: BSE, NSE release holiday calendar for 2025 - check full list of month-wise stock market holidays",
        "info": "Stock market BSE, NSE holidays 2025: The stock exchanges in India have announced 14 trading holidays for 2025. In February, May, November and December there will be one holiday, while March and August will have two holidays each. April and October will see three trading holidays each.This schedule was released by the stock exchange authorities a few days ago. It's also important to note that a special trading session has been announced for Saturday, February 1, 2025, the day the Union Budget 2025-26 will be announced by the Finance Minister.BSE, NSE Stock Market Holidays 2025: Full listDateDayHolidayFebruary 26, 2025WednesdayMahashivratriMarch 14, 2025FridayHoliMarch 31, 2025MondayId-Ul-Fitr (Ramadan Eid)April 10, 2025ThursdayShri Mahavir JayantiApril 14, 2025MondayDr. Baba Saheb Ambedkar JayantiApril 18, 2025FridayGood FridayMay 01, 2025ThursdayMaharashtra DayAugust 15, 2025FridayIndependence DayAugust 27, 2025WednesdayGanesh ChaturthiOctober 02, 2025ThursdayMahatma Gandhi Jayanti/DussehraOctober 21, 2025TuesdayDiwali Laxmi Pujan*October 22, 2025WednesdayDiwali-BalipratipadaNovember 05, 2025WednesdayPrakash Gurpurb Sri Guru Nanak DevDecember 25, 2025ThursdayChristmas**Muhurat Trading will be conducted on Tuesday, October 21, 2025. Timings of Muhurat Trading shall be notifiedsubsequentlyThe first stock market holiday of 2025 will be on February 26, Wednesday, for Mahashivratri celebrations.March holidays are scheduled for the 14th (Friday) for Holi and 31st (Monday) for Id-Ul-Fitra (Ramzan Id).Three holidays in April fall on the 10th (Thursday), 14th (Monday) and 18th (Friday), marking Shri Mahavir Jayanti, Dr. Baba Saheb Ambedkar Jayanti and Good Friday respectively.Maharashtra Day will be observed on May 1 (Thursday). The markets will be closed on August 15 (Friday) for Independence Day and August 27 (Wednesday) for Ganesh Chaturthi.October's three holidays include Mahatma Gandhi Jayanti/Dussehra on October 02 (Thursday), Diwali on October 21 (Tuesday), and Diwali Balipratipada on October 22 (Wednesday).The exchanges will conduct Muhurat Trading on Tuesday, October 21, 2025, with timing details to be announced later.Trading will be suspended on November 5 (Wednesday) for Prakash Gurpurb Sri Guru Nanak Dev Jayanti and December 25 (Thursday) for Christmas.Several holidays coincide with weekends: Republic Day (January 26), Shri Ram Navami (April 06) and Muharram (July 06) fall on Sundays, whilst Bakri Id occurs on Saturday, June 7."
    },
    {
        "id": 24,
        "url": "https://timesofindia.indiatimes.com/entertainment/english/music/news/beyonce-shines-at-nfl-christmas-halftime-show-with-record-breaking-cowboy-carter-album/articleshow/116674312.cms",
        "title": "Beyonce shines at NFL Christmas halftime show with record-breaking 'Cowboy Carter' album",
        "info": "The cheer of the crowd from the NFL is filled every nook and cranny of the world. Of course, the great play by the Houston Texans versus Baltimore Ravens game is all things exciting, but it is not the only highlight at the NFL. Beyonce's brilliant Christmas NFL halftime performance is another element that has grabbed all the limelight.Beyonce, the name itself is enough to create a buzz. From her appearance to her music to her performance, everything about the singer catches attention in a jiffy. And today, at her Christmas NFL halftime show, the audience wanted to know more about the country album ‘Cowboy Carter’Cowboy Carter - Setting a recordBeyonce’s performance at Christmas NFL halftime became a major highlight of the game as it was streaming on OTT. The album is already a major hit among the fans which everyone knows; however, what many might not know is that with this musical outing, Beyonce became the first Black woman to lead the country album list. Right after its debut, the ‘Cowboy Carter’ topped the Billboard Hot 200 album chart after its debut. Then as she performed at the NFL Christmas halftime show, it left the audience speechless. In addition to this, the country album has received 11 Grammys nominations right after its release. These nominations brought Beyonce into the spotlight when Taylor Swift was dominating with ‘TTPD’ album and her Eras Tour shows.Earlier Beyonce performed at the Super Bowl halftime event on Christmas, and it became one of the biggest shows in NFL for 2024."
    },
    {
        "id": 25,
        "url": "https://www.businesstoday.in/visualstories/news/equal-to-9-billion-suns-nasas-james-webb-telescope-captures-latest-pictures-of-sombrero-galaxy-189985-27-11-2024",
        "title": "‚ÄòEqual to 9 billion suns‚Äô: NASA‚Äôs James Webb Telescope captures latest pictures of Sombrero galaxy",
        "info": "Produced by:Tarun MishraDesigned by: Manoj Kumar NASA’s James Webb Space Telescope has captured a detailed mid-infrared image of the Sombrero galaxy, revealing new features and challenging previous observations of this well-known celestial object. The mid-infrared view, taken by Webb’s MIRI (Mid-Infrared Instrument), alters the galaxy’s typical hat-like appearance, showcasing it as a structure resembling an archery target, with a dimmed core and a smooth inner disk. The image highlights intricate dust clumps in the galaxy’s outer ring, providing astronomers with valuable information about the distribution of material and the galaxy’s structural composition. The detection of polycyclic aromatic hydrocarbons—carbon-based molecules often associated with star-forming regions—suggests potential for stellar activity, though the Sombrero galaxy remains relatively quiet in star production. Compared to the Milky Way’s production of two solar masses of stars annually, the Sombrero galaxy forms fewer than one solar mass per year, reflecting its subdued star-forming activity. At the heart of the galaxy lies a supermassive black hole with a mass equivalent to 9 billion suns. Despite its immense size, this black hole is relatively inactive, consuming material at a slow pace and emitting a faint jet. Thegalaxy, located 30 million light-years away in the Virgo constellation, is home to approximately 2,000 globular clusters, providing astronomers with opportunities to study the life cycles of stars. This image is part of Webb’s mission to explore cosmic mysteries. As the telescope prepares for its fourth year of science operations in , its observations continue to offer groundbreaking insights into the universe."
    },
    {
        "id": 26,
        "url": "https://www.businesstoday.in/visualstories/news/minus-7-degrees-srinagars-dal-lake-turns-into-an-icy-wonderland-see-for-yourself-196573-23-12-2024",
        "title": "'Minus 7 Degrees!': Srinagar‚Äôs Dal Lake turns into an icy wonderland. See for yourself",
        "info": "Produced by: Mohsin Shaikh Dal Lake’s surface froze under a bone-chilling -7°C as an intense cold wave gripped Srinagar, marking one of the coldest nights in decades. Residents marveled at the icy transformation of Dal Lake while bracing for severe cold and possible snowfall predicted by the IMD. Locals gathered around bonfires, wrapped in heavy woolens, fighting to stay warm as the valley witnessed extreme winter conditions. December’s freezing temperatures marked Srinagar’s coldest in 50 years, as noted by Chillai Kalan, the harshest 40 days of winter. Meteorologists forecast a high likelihood of snowfall in the region, adding a snowy blanket to the already frosty landscape. Amid the severe cold, power outages added to the challenges, prompting Chief MinisterOmar Abdullahto oversee electricity and water supply issues. Despite the freeze, Kashmiris showcased resilience, adapting to the biting cold with age-old traditions and community warmth. The icy allure of Dal Lake turned it into a tourist hotspot, drawing visitors eager to witness this rare winter phenomenon. The frozen Dal Lake serves as a stark reminder of the region’s harsh winters and the challenges posed by extreme weather."
    },
    {
        "id": 27,
        "url": "https://www.businesstoday.in/visualstories/news/james-webb-has-competition-nasas-next-gen-telescope-roman-enters-final-assembly-stage-195593-19-12-2024",
        "title": "'James Webb has competition': NASA‚Äôs next-gen telescope Roman enters final assembly stage",
        "info": "Produced by: Mohsin Shaikh NASA’s Nancy Grace Roman Space Telescope completed integration of instruments, marking a major milestone. The Coronagraph Instrument and Optical Telescope Assembly are now installed for groundbreaking cosmic exploration. The Wide Field Instrument, a 300-megapixel infrared camera, will capture panoramic views of the universe. Roman’s precision instruments will investigate dark energy, dark matter, and the evolution of galaxies. The Coronagraph Instrument’s advanced technology will directly image distant exoplanets, blocking starlight for clarity. With unmatched stability, Roman will observe billions of objects with 10 times the stability of James Webb. The assembly process continues, keeping the telescope on schedule for a completion and launch. NASA scientists, led by engineers likeJody Dawsonand Julie McEnery, ensure Roman is built for excellence. Roman promises to transform the field, addressing a wider range of cosmic mysteries than any predecessor."
    },
    {
        "id": 28,
        "url": "https://www.businesstoday.in/visualstories/news/hidden-galaxies-found-james-webb-telescope-discovers-the-universes-forgotten-cities-192980-10-12-2024",
        "title": "'Hidden galaxies found': James Webb Telescope discovers the Universe‚Äôs forgotten cities",
        "info": "Produced by: Manoj Kumar Astronomers using the James Webb Space Telescope unveiled obscured galaxies in the Spiderweb protocluster, reshaping theories about galaxy formation. The Spiderweb protocluster shows galaxies in their “teenage” phase, offering insights into how vast cosmic structures assemble over billions of years. Webb’s infrared capabilities pierced cosmic dust, revealing galaxies previously hidden, enhancing our understanding of the early universe’s structures. Astronomers discovered more galaxy members in the cluster than anticipated, challenging long-held assumptions about star formation and dust levels. Findings suggest star formation in these galaxies is fueled by gas accumulation rather than collisions or gravitational mergers as previously thought. In just 3.5 hours of observing time, Webb revealed significant details about hydrogen gas and galaxy composition within the protocluster. Astronomers note that as the Spiderweb protocluster grows, the physical traits of its galaxies are transforming, shaping the future of cosmic cities. Galaxies like the Milky Way in the protocluster were found to be less dust-filled than expected, altering the understanding of their developmental triggers. Next steps involve spectroscopic observations using Webb to confirm and analyze the newly discovered galaxies, potentially unlocking more cosmic secrets."
    },
    {
        "id": 29,
        "url": "https://www.businesstoday.in/visualstories/news/her-body-is-breaking-down-doctors-raise-fresh-alarm-over-sunita-williams-extended-stay-196831-24-12-2024?utm_source=rssfeed",
        "title": "'Her body is breaking down':  Doctors raise fresh alarm over Sunita Williams‚Äô extended stay",
        "info": "Produced by: Mohsin Shaikh NASA’s decision to delay Sunita Williams and Barry Wilmore’s return to Earth until March has left health experts deeply alarmed, warning of the dangers of prolonged space exposure. Dr. John Jaquish, a biomedical engineer, warned in a Daily Mail report that Williams faces an “extreme risk of fragility fracture,” with predictions that she may not walk unaided upon return. Psychiatrist Dr. Carole Liberman in the same report said Williams’ prolonged stay in space could lead to a psychological breakdown, amplifying physical health risks. With Boeing’s Starliner grounded due to technical flaws, experts warn the astronauts’ extended isolation aboard the ISS could compound health risks beyond repair. Originally meant to last just eight days, this mission has ballooned to 300 days, a duration experts say will leave permanent physical and mental scars. Dr. Jaquish said Williams’ muscle deterioration in zero gravity could lead to organ failure, stating, “Her body is essentially breaking down.” As microgravity erodes bone density, Williams’ ability to stand or walk upon her return is at critical risk, doctors claimed. NASA studies show prolonged missions harden arteries, with Dr. Jaquish explaining that Williams faces heightened risks of heart attack and stroke. While Dr. Vinay Gupta said astronauts are trained for contingencies, he warned, “No training can fully prepare the body for this prolonged onslaught.”"
    }
]